In [12]:
import pandas as pd
import numpy as np
station = pd.read_csv("./station.csv", error_bad_lines=False)
trip = pd.read_csv("./trip.csv", error_bad_lines=False)
weather = pd.read_csv("./weather.csv", error_bad_lines=False)

b'Skipping line 50794: expected 12 fields, saw 20\n'

## What is the average trip duration for a borrowed bicycle?

In [13]:
pd.DataFrame(trip['tripduration']).mean()/60

tripduration    19.638261
dtype: float64

## What's the most common age of a bicycle-sharer?

In [50]:
2018-trip['birthyear'].head(1)

0    58.0
Name: birthyear, dtype: float64

### Given all the weather data here, find the average precipitation per month, and the median precipitation.

In [30]:
weather['Date'] = pd.to_datetime(weather['Date'], errors='coerce')
weather['Month'] = weather['Date'].dt.month
avg = pd.DataFrame(weather[['Month','Precipitation_In']]).groupby(weather.Month).mean()
avg.sort_values('Precipitation_In', ascending=False)

       Month  Precipitation_In
Month
12        12          0.236290
10        10          0.189000
11        11          0.187833
2          2          0.168421
3          3          0.156935
1          1          0.143548
4          4          0.051333
9          9          0.041000
6          6          0.030500
8          8          0.018226
5          5          0.012419
7          7          0.012097

In [38]:
print("MEAN IS %s" % avg['Precipitation_In'].mean())

MEAN IS 0.1039669873608753

## What’s the average number of bikes at a given bike station?

In [39]:
print("AVGERAGE %s" % int(station['current_dockcount'].mean()))

AVGERAGE 16

### When a bike station is modified, is it more likely that it’ll lose bikes or gain bikes? How do you know?

##### Come up with 3 more questions that can be answered with this data set.

## How many bikes have been borrowed?

In [91]:
pd.DataFrame(trip[['from_station_name']]).count()

from_station_name    286857
dtype: int64

## What location was the last bike Taken From?

In [90]:
trip.ix[:0][:]

,trip_id,starttime,stoptime,bikeid,tripduration,from_station_name,to_station_name,from_station_id,to_station_id,usertype,gender,birthyear,age
0,431,10/13/2014 10:31,10/13/2014 10:48,SEA00298,985.935,2nd Ave & Spring St,Occidental Park / Occidental Ave S & S Washing...,CBD-06,PS-04,Member,Male,1960.0,58.0

## What place has the least Bikes?

In [99]:
station_data = station.sort_values('current_dockcount', ascending=True).head()
station_data

,station_id,name,lat,long,install_date,install_dockcount,modification_date,current_dockcount,decommission_date
46,UW-01,UW McCarty Hall / Whitman Ct,47.660268,-122.304826,10/13/2014,16,10/29/2015,0,10/29/2015
38,SLU-18,Dexter Ave & Denny Way,47.618285,-122.342205,10/13/2014,20,11/2/2015,0,7/2/2016
10,CD-01,12th Ave & E Yesler Way,47.602103,-122.316923,5/22/2015,16,8/9/2016,0,8/9/2016
26,FH-01,Frye Art Museum / Terry Ave & Columbia St,47.607281,-122.324783,10/13/2014,16,3/18/2016,0,3/18/2016
19,CH-12,Bellevue Ave & E Pine St,47.615456,-122.326729,10/13/2014,18,NaN,14,NaN